class Strings {
  static const String traditional = "సంప్రదాయ";
  static const String GenZ = "GenZ";
  static const String spiritual = "ఆధ్యాత్మికం";
  static const String modern = "ఆధునిక";
  static const Map<String,dynamic> constants = {
    "english": {
      "gender": "Gender",
      "religion": "Religion",
      "letter": "Letter",
      "search":"search",
      "alphabets": ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"]
    },
    "hindi": {
      "gender": "लिंग",
      "religion": "धर्म",
      "letter": "अक्षर",
      "alphabets": ["अ", "आ", "इ", "ई", "उ", "ऊ", "ए", "ऐ", "ओ", "औ", "क", "ख", "ग", "घ", "च", "छ", "ज", "झ", "ट", "ठ", "ड", "ढ", "ण", "त", "थ", "द", "ध", "न", "प", "फ", "ब", "भ", "म", "य", "र", "ल", "व", "श", "ष", "स", "ह"]
    },
    "bengali": {
      "gender": "লিঙ্গ",
      "religion": "ধর্ম",
      "letter": "অক্ষর",
      "alphabets": ["অ", "আ", "ই", "ঈ", "উ", "ঊ", "এ", "ঐ", "ও", "ঔ", "ক", "খ", "গ", "ঘ", "চ", "ছ", "জ", "ঝ", "ট", "ঠ", "ড", "ঢ", "ণ", "ত", "থ", "দ", "ধ", "ন", "প", "ফ", "ব", "ভ", "ম", "য", "র", "ল", "শ", "ষ", "স", "হ"]
    },
    "telugu": {
      "gender": "లింగం",
      "religion": "మతం",
      "letter": "అక్షరం",
      "search":"శోధన",
      "alphabets": ["అ", "ఆ", "ఇ", "ఈ", "ఉ", "ఊ", "ఎ", "ఐ", "ఒ", "ఔ", "క", "ఖ", "గ", "ఘ", "చ", "ఛ", "జ", "ఝ", "ట", "ఠ", "డ", "ఢ", "ణ", "త", "థ", "ద", "ధ", "న", "ప", "ఫ", "బ", "భ", "మ", "య", "ర", "ల", "వ", "శ", "ష", "స", "హ"]
    },
    "tamil": {
      "gender": "இனம்",
      "religion": "மதம்",
      "letter": "எழுத்து",
      "alphabets": ["அ", "ஆ", "இ", "ஈ", "உ", "ஊ", "எ", "ஏ", "ஐ", "ஒ", "ஓ", "ஔ", "க", "ங", "ச", "ஞ", "ட", "ண", "த", "ந", "ப", "ம", "ய", "ர", "ல", "வ", "ழ", "ள", "ற", "ன", "ஶ", "ஷ", "ஸ", "ஹ"]
    },
    "gujarati": {
      "gender": "લિંગ",
      "religion": "ધર્મ",
      "letter": "અક્ષર",
      "alphabets": ["અ", "આ", "ઇ", "ઈ", "ઉ", "ઊ", "એ", "ઐ", "ઓ", "ઔ", "ક", "ખ", "ગ", "ઘ", "ચ", "છ", "જ", "ઝ", "ટ", "ઠ", "ડ", "ઢ", "ણ", "ત", "થ", "દ", "ધ", "ન", "પ", "ફ", "બ", "ભ", "મ", "ય", "ર", "લ", "વ", "શ", "ષ", "સ", "હ"]
    },
    "kannada": {
      "gender": "ಲಿಂಗ",
      "religion": "ಧರ್ಮ",
      "letter": "ಅಕ್ಷರ",
      "alphabets": ["ಅ", "ಆ", "ಇ", "ಈ", "ಉ", "ಊ", "ಎ", "ಏ", "ಐ", "ಒ", "ಓ", "ಔ", "ಕ", "ಖ", "ಗ", "ಘ", "ಚ", "ಛ", "ಜ", "ಝ", "ಟ", "ಠ", "ಡ", "ಢ", "ಣ", "ತ", "ಥ", "ದ", "ಧ", "ನ", "ಪ", "ಫ", "ಬ", "ಭ", "ಮ", "ಯ", "ರ", "ಲ", "ವ", "ಶ", "ಷ", "ಸ", "ಹ"]
    },
    "odia": {
      "gender": "ଲିଙ୍ଗ",
      "religion": "ଧର୍ମ",
      "letter": "ଅକ୍ଷର",
      "alphabets": ["ଅ", "ଆ", "ଇ", "ଈ", "ଉ", "ଊ", "ଏ", "ଐ", "ଓ", "ଔ", "କ", "ଖ", "ଗ", "ଘ", "ଚ", "ଛ", "ଜ", "ଝ", "ଟ", "ଠ", "ଡ", "ଢ", "ଣ", "ତ", "ଥ", "ଦ", "ଧ", "ନ", "ପ", "ଫ", "ବ", "ଭ", "ମ", "ୟ", "ର", "ଲ", "ଶ", "ଷ", "ସ", "ହ"]
    },
    "malayalam": {
      "gender": "ലിംഗം",
      "religion": "മതം",
      "letter": "അക്ഷരം",
      "alphabets": ["അ", "ആ", "ഇ", "ഈ", "ഉ", "ഊ", "എ", "ഏ", "ഐ", "ഒ", "ഓ", "ഔ", "ക", "ഖ", "ഗ", "ഘ", "ച", "ഛ", "ജ", "ഝ", "ട", "ഠ", "ഡ", "ഢ", "ണ", "ത", "ഥ", "ദ", "ധ", "ന", "പ", "ഫ", "ബ", "ഭ", "മ", "യ", "ര", "ല", "വ", "ശ", "ഷ", "സ", "ഹ"]
    },
    "punjabi": {
      "gender": "ਲਿੰਗ",
      "religion": "ਧਰਮ",
      "letter": "ਅੱਖਰ",
      "alphabets": ["ਅ", "ਆ", "ਇ", "ਈ", "ਉ", "ਊ", "ਏ", "ਐ", "ਓ", "ਔ", "ਕ", "ਖ", "ਗ", "ਘ", "ਙ", "ਚ", "ਛ", "ਜ", "ਝ", "ਟ", "ਠ", "ਡ", "ਢ", "ਣ", "ਤ", "ਥ", "ਦ", "ਧ", "ਨ", "ਪ", "ਫ", "ਬ", "ਭ", "ਮ", "ਯ", "ਰ", "ਲ", "ਵ", "ਸ਼", "ਸ", "ਹ"]
    }
  };
}